# Сообщения для команды добавления учителя
ENTER_TEACHER_ID = "Введите ID учителя:"
NO_ACCESS = "У вас нет доступа к этой команде."
TEACHER_ADDED = "Учитель с ID {} добавлен и удалён из списка ожидания."
INVALID_TEACHER_ID = "Пожалуйста, введите корректный ID учителя."

# Сообщения для команды "start"
CHOOSE_ACTION = "Выберите действие:"
LATEST_ASSIGNMENT_PHOTO_CAPTION = "Ваше текущее задание."
LATEST_ASSIGNMENT_DOC_CAPTION = "Ваше текущее задание."
ENTER_ANSWER = "Пожалуйста, введите Ваш ответ на задание."
NO_ASSIGNMENTS = "Пока нет заданий для Вас."
ADDED_TO_WAITING_LIST = "Отправьте Ваш ID учителю.\nПосле подтверждения вы получите доступ к заданиям.\nВаш ID:"
WAITING_FOR_ADDING = "Вас уже добавляют. Просьба немного подождать."

# Сообщения для обработки ответов учеников
CORRECT_ANSWER = "Ваш ответ верный!"
INCORRECT_ANSWER = "Ответ неверный. Попробуйте еще раз."
ASSIGNMENT_NOT_FOUND = "Не удалось найти задание для проверки ответа."

# Сообщения для команды "добавить ученика"
ENTER_STUDENT_ID = "Введите ID ученика:"
COMMAND_FOR_TEACHERS_ONLY = "Эта команда доступна только учителям."
ENTER_REAL_NAME = "Как назвать ученика?"
INCORRECT_STUDENT_ID = "Пожалуйста, введите корректный ID ученика."
STUDENT_ADDED = "Ученик с ID {} и именем '{}' добавлен."
STUDENT_NOTIFICATION_ADDED = "Поздравляю!\nВам открыт доступ к заданиям!"

# Сообщения для команды "добавить задание"
SEND_ASSIGNMENT_FILE = "Отправьте файл с заданием."
ASSIGNMENT_FOR_TEACHERS_ONLY = "Эта команда доступна только учителям."
ASSIGNMENT_UPLOADED = "Введите правильный ответ на задание."
CORRECT_ANSWER_SAVED = "Задание успешно добавлено.\nВашим ученикам отправлено уведомление."